<!-- 代理协议 -->
<template lang="html">
  <div class="agent">
    <p class="title">大虎鲸Ai智投代理商服务协议</p>
    <p class="title2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本协议由厦门小蚜虫量化软件开发有限公司旗下大虎鲸Ai智投系统（“本公司”）及其关联公司及其运营合作单位（以下统称为“大虎鲸Ai智投”）和您签订。</p>
    <p class="title3">一、大虎鲸AI智投代理协议的确认</p>
    <p  class="con1">1.本协议有助于您了解本公司为您提供的服务内容及您使用服务的权利和义务，请您仔细阅读（特别是以粗体标注的内容）。您一经注册或使用本服务即视为对本协议全部条款已充分理解并完全接受，本协议在小蚜虫与您之间成立并生效。</p>
    <p  class="con1">2.如本协议发生变更，本公司将通过大虎鲸AI智投官网、小蚜虫官网、大虎鲸AI智投公众号、小蚜虫股票助手公众号公告的方式提前予以公布，变更内容的生效时间以公告时间为准。若您在本协议变更后继续使用大虎鲸AI智投服务的，表示您接受变更后的协议，变更后的协议因您继续使用大虎鲸AI智投服务的行为而生效，同时，您将遵循变更后的协议使用大虎鲸AI智投服务。</p>
    <p  class="con1">3.本协议内容以及大虎鲸AI智投已经发布的或将来可能发布的各类规则、操作流程等所有规则共同组成本协议不可分割的一部分，与本协议具有同等的法律效力。</p>
    <p  class="con1">4.如您为无民事行为能力人（不满18周岁的未成年人或不能辨认自己行为的精神病人）或为限制民事行为能力人（18周岁以上的未成年人或不能完全辨认自己行为的精神病人），请告知您的监护人，并在您监护人的指导下阅读本协议和使用大虎鲸AI智投服务。若您是中华人民共和国行政管辖区域以外的用户，您还需同时遵守您所属国家或地区的法律，且您确认，订立并履行本协议不受您所属、所居住或开展经营活动或其他业务的国家或地区法律法规的限制。</p>
    <p class="title3">二、代理规则</p>
    <p class="con1">1.代理费按年一次性收取，代理权限有效期为一年。</p>
    <p class="con1">2.在有效期内交纳升级费用，可实现代理升级，升级费用以升级后星级应收费用减去当前星级已付费用；代理权限有效期以实际付款时间为准，为期一年。</p>
    <p class="con1">3.代理可跳级升级。</p>
    <p class="con1">4.一星代理享有基本权限：发展客户的权利及发展客户的收益权；二星代理以上（含二星）除享有基本权限外，还享有发展代理的权利及享有下级代理发展客户的差额收益权。</p>
    <p class="con1">5.在有效期内，代理发展客户的收益，公司按对应等级的佣金比例发放佣金。</p>
    <p class="con1">6.在有效期内及续签期内，代理享有其已发展下级代理的客户收益，按佣金比例差额享受佣金。</p>
    <p class="title3">三、大虎鲸Ai智投平台提供的服务内容</p>
    <p class="con1">1.大虎鲸AI智投为您提供合同管理服务。用户在大虎鲸AI智投平台交易时订立的合同采用电子合同方式签约和管理。</p>
    <p class="con1">2.大虎鲸AI智投为用户提供程序交易服务，包括策略本协议有助于您了解本公司为您提供的服务内容及您使用服务的权利和义务，请您仔细阅读（特别是以粗体标注的内容）。您一经注册或使用本服务即视为对本协议全部条款已充分理解并完全接受，本协议在小蚜虫与您之间成立并生效。展示，系统选股，系统买卖等。</p>
    <p class="con1">3.大虎鲸AI智投根据用户选择的策略，为用户提供程序化交易的系统服务,用户签订电子合同后，即视为用户同意向大虎鲸Ai智投系统可以执行您的证劵账户。 </p>
    <p class="con2">用户签订电子合同后，即视为用户同意向大虎鲸Ai智投系统可以执行您的证劵账户。</p>
    <p class="con1">4.使用大虎鲸Ai智投服务的注意事项</p>
    <p class="con2">使用大虎鲸AI智投服务的注意事项,为有效保障您使用大虎鲸AI智投服务时的合法权益，大虎鲸AI智投提醒您注意以下事项：</p>
    <p class="title4">（一） 身份验证</p>
    <p class="con1">1.您在注册、使用大虎鲸AI智投服务的过程中，应提供合法、真实、有效、准确并完整的资料（包括但不限于身份证、户口本、护照等证明、联系方式、从事职业、通讯地址）。 为了能将账户资金变动及时通知到您，以及更好保障您的账户安全，相关账户、密码、资金规模资料发生变更，请您及时通知大虎鲸AI智投。 为了及时有效地验证您的信息（包括但不限于身份信息、账户信息、购汇额度）和持续、便捷的为您提供服务，根据法律法规及监管规定或大虎鲸AI智投认为有需要时，您同意我们可以把您的信息提供给第三方证券公司，也同意第三方可以把您的信息提供给大虎鲸AI智投，以便大虎鲸AI智投进行验证。</p>
    <p class="title4">（二） 注意事项</p>
    <p class="con1">1.您认可大虎鲸AI智投账户的使用记录、交易数据等均以大虎鲸AI智投系统记录为准。如您对该等数据存有异议的，可及时向大虎鲸AI智投提出异议，并提供相关证据供大虎鲸AI智投核实。</p>
    <p class="con1">2.大虎鲸AI智投将为您投资和收益等交易服务过程中根据有关文件、协议和本网站页面的相关规则、说明等收取必要的系统服务和管理费用，其具体内容、比例、金额等事项请参见有关文件及本网站相关页面的规则和说明。您同意，大虎鲸AI智投有权不定期调整前述服务或管理费用的类型或金额等具体事项，并根据本协议和相关规则进行公告、修改。</p>
    <p class="con1">3.身份要素是大虎鲸AI智投识别您身份的依据，请您务必妥善保管。使用身份要素进行的任何操作、发出的任何指令均视为您本人做出。因您的原因造成的账户、密码等信息被冒用、盗用或非法使用，由此引起的一切风险、责任、损失、费用等应由您自行承担。 您同意：</p>
    <p class="con3">(1)大虎鲸AI智投账户仅限您本人使用，不可转让、借用、赠与、继承，但大虎鲸AI智投账户内的相关财产权利义务可被依法继承，法律另有规定的除外。</p>
    <p class="con3">(2)基于运行和交易安全的需要，大虎鲸AI智投可以暂停或者限制大虎鲸AI智投服务部分功能，或增加新的功能。</p>
    <p class="con1">4.您理解，大虎鲸AI智投服务有赖于系统的准确运行及操作。若出现系统差错、故障或其他原因引发的展示错误、您或大虎鲸AI智投不当获利等情形，您同意大虎鲸AI智投可以采取更正差错等适当纠正措施。</p>
    <p class="title4">（三） 风险提示</p>
    <p class="con1">1.您在决定使用大虎鲸AI系统服务前，您清楚并理解进行金融交易将面对市场波动的风险，因此，您应对大虎鲸AI智投平台发布的产品、服务信息进行全面细致的了解，审慎的评估风险，独立自主作出决定。</p>
    <p class="con1">2.大虎鲸AI智投不对您的任何行为及产生的后果提供任何明示、默示的担保。大虎鲸AI智投向您提供的各种信息和资料仅为参考，您自行承担金融交易风险。</p>
    <p class="title3">五、用户合法使用大虎鲸Ai智投服务的承诺</p>
    <p class="con1">您应遵守中华人民共和国相关法律法规，不得将大虎鲸AI智投服务用于任何非法目的（包括用于反洗钱法律法规所禁止和限制的交易）。</p>
    <p class="con1">您不得利用大虎鲸AI智投服务从事侵害他人合法权益之行为或违反国家法律法规， 否则大虎鲸AI智投有权进行调查、延迟或拒绝结算或停止提供大虎鲸AI智投服务，且您应独立承担所有相关法律责任，因此导致大虎鲸AI智投或大虎鲸AI智投雇员或其他方受损的，您应承担赔偿责任。</p>
    <p class="con1">上述1和2适用的情况包括但不限于：</p>
    <p class="con3">(1)侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。</p>
    <p class="con3">(2)冒用他人名义使用大虎鲸AI智投服务。</p>
    <p class="con3">(3)从事不法交易行为， 如洗钱、恐怖融资、贩卖枪支、毒品、禁药、盗版软件、黄色淫秽物品、其他大虎鲸AI智投认为不得使用大虎鲸AI智投服务进行交易的物品等。</p>
    <p class="con3">(4)提供赌博资讯或以任何方式引诱他人参与赌博。</p>
    <p class="con3">(5)未经授权使用他人银行卡， 或利用信用卡套取现金。</p>
    <p class="con3">(6)进行与您或交易对方宣称的交易内容不符的交易， 或不真实的交易。</p>
    <p class="con3">(7)从事任何可能侵害大虎鲸AI智投服务系统、数据之行为。</p>
    <p class="con1">4.您不得对大虎鲸AI智投系统和程序采取反向工程手段进行破解，不得对上述系统和程序如（源程序、目标程序、技术文档、客户端至服务器端的数据、服务器数据）进行复制、修改、编译、整合或篡改，不得修改或增减大虎鲸AI智投系统的任何功能。</p>
    <p class="title3">六、信息使用与隐私保护</p>
    <p class="con1">1.您知晓并同意，大虎鲸AI智投为提供本协议的服务，有权将您的身份要素向交易对方或第三方提供。大虎鲸AI智投承诺不会将您的身份信息在服务之外的目的使用。</p>
    <p class="con1">2.大虎鲸AI智投可能从您公开或您授权的资料来源获取用户的信息数据，以更好地了解使用大虎鲸AI智投的用户，以确保在大虎鲸AI智投平台进行交易的安全性。大虎鲸AI智投仅收集大虎鲸AI智投认为就此目的及达成该目的所必需的信息数据。</p>
    <p class="con1">3.您知晓并同意大虎鲸AI智投有义务根据有关法律要求向司法机关和政府部门提供您的个人信息。在您未能按照大虎鲸AI智投有关规则或者与大虎鲸AI智投平台其他第三方签订的有关协议的义务时，大虎鲸AI智投有权根据自己的判断和有关协议及规则、国家生效法律裁决文书披露用户信息（包括但不限于在大虎鲸AI智投平台公布用户的违法、违约行为，及将该内容计入任何与用户相关的信用资料、档案或数据库），大虎鲸AI智投对此不承担任何责任。</p>
    <p class="con1">4.如您通过签署协议等方式获得他人的个人信息，您同意并承诺不得恶意使用他人信息或将他人个人信息用于任何非法目的。</p>
    <p class="con1">5.大虎鲸AI智投重视对您隐私的保护。关于您的身份资料和其他特定资料依据大虎鲸AI智投《隐私政策》受到保护与规范，详情请参阅《隐私政策》。</p>
    <p class="con1">6.您知晓并同意大虎鲸Ai智投有义务根据有关法律要求向司法机关和政府部门提供您的个人信息。在您未能按照大虎鲸Ai智投有关规则或者与大虎鲸Ai智投平台其他第三方签订的有关协议的义务时，大虎鲸Ai智投有权根据自己的判断和有关协议及规则、国家生效法律裁决文书披露用户信息（包括但不限于在大虎鲸Ai智投平台公布用户的违法、违约行为，及将该内容计入任何与用户相关的信用资料、档案或数据库），大虎鲸Ai智投对此不承担任何责任。</p>
    <p class="title3">七、终止服务</p>
    <p class="con1">大虎鲸AI智投有权基于单方独立判断，在认为可能发生危害安全等情形时，不经通知而现行暂停、中断或终止向您提供本协议项下的全部或部分服务，甚至将注册资料封存、移除或删除，且无需向您或其他第三方承担任何责任。包括但不限于：</p>
    <p class="con1">1.大虎鲸AI智投发现异常交易或有异议或有违法嫌疑时；</p>
    <p class="con1">2.大虎鲸AI智投认为您使用大虎鲸AI智投账户涉嫌洗钱、套取现金、传销、恶意使用他人身份信息或使用他人身份信息参与违法活动等情形；</p>
    <p class="con1">3.大虎鲸Ai智投认为您已经违反本协议中规定的各类规则及精神；</p>
    <p class="con1">4.您在使用收费服务时未按规定向大虎鲸Ai智投支付相应的费用；</p>
    <p class="con1">5.符合大虎鲸Ai智投《用户协议》中规定的情形</p>
    <p class="con1">6.大虎鲸Ai智投有理由认为违反国家法律或侵害大虎鲸Ai智投或他人利益的情形</p>
    <p class="title3">八、不可抗力、免责及责任限制</p>
    <p class="title4">（一）免责条款</p>
    <p class="con1">因下列原因导致大虎鲸Ai智投无法正常提供服务，大虎鲸Ai智投不承担责任：</p>
    <p class="con1">1.大虎鲸Ai智投系统停机维护或升级；</p>
    <p class="con1">2.因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；</p>
    <p class="con1">3.用户的电脑软硬件和通信线路、供电线路出现故障的；</p>
    <p class="con1">4.用户操作不当或通过非大虎鲸Ai智投授权和认可的方式使用大虎鲸Ai智投服务的；</p>
    <p class="con1">5.因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因。</p>
    <p class="con1">6.尽管有前款约定，大虎鲸Ai智投将采取合理行动积极促使服务恢复正常。</p>
    <p class="title4">（二）大虎鲸Ai智投责任范围及责任限制</p>
    <p class="con1">1.大虎鲸Ai智投用户信息是由用户本人自行提供的，大虎鲸Ai智投无法保证该信息之准确、有效和完整。</p>
    <p class="con1">2.大虎鲸Ai智投可能同时为您及您的（交易）对手方提供大虎鲸Ai智投服务，您同意对大虎鲸Ai智投可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张大虎鲸Ai智投在提供大虎鲸Ai智投服务时存在法律上的瑕疵。</p>
    <p class="title3">九、知识产权的保护</p>
    <p class="con1">1.大虎鲸AI智投及关联公司所有系统及本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的排版、网页设计，均由大虎鲸AI智投或大虎鲸AI智投关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>
    <p class="con1">2.非经大虎鲸AI智投或大虎鲸AI智投关联公司书面同意，任何人不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。</p>
    <p class="con1">3.尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。</p>
    <p class="title3">十、法律适用与管辖</p>
    <p class="con1">本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由被告住所地人民法院管辖。</p>
    <Back/>
  </div>
</template>

<script>
import Back from '@/components/backCom/backBtn'
export default {
  components:{Back}
}
</script>

<style lang="scss" scoped>
.agent{
  width: 100%;
  padding-bottom: .2rem;
  p{
    text-align: justify;
    font-size: $fontText;
    width: 90%;
    margin:0 auto;
  }
  .title{
    text-align: center;
    line-height: .5rem;
    font-size: .18rem;
    font-weight: bold;
  }
  .title2{
    font-size: $fontTitle;
  }
  .title3{
    margin-top: .1rem;
    font-weight: bold;
    font-size: $fontTitle;
  }
  .title4{
    margin-top: .1rem;
    font-weight: bold;
  }
  .con1{
    margin-top: .1rem;
  }
  .con3{
    box-sizing: border-box;
    margin-top: .1rem;
    padding-left: .1rem;
  }
}
</style>
